Revit 2026 API
MassSurfaceData.PercentageGlazing Property
 The target percentage of the reference wall surface that is to be covered with automatically generated windows. Revit will use this number when determining the size, shape, and location of automatically generated windows.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double PercentageGlazing { get; set; }
Public Property PercentageGlazing As Double
	Get
	Set
public:
property double PercentageGlazing {
	double get ();
	void set (double value);
}
member PercentageGlazing : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The percentage glazing value is not between 0.00 and 0.95.
Remarks
 The resulting coverage of the wall with windows is not guaranteed to match this value. It is a target.
See Also
Reference
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace